In [1]:
import numpy as np

In [25]:
import pandas as pd
from pandas import Series, DataFrame

In [5]:
#create a dataframe from clipboard
age_df = pd.read_clipboard()
print(age_df)

  First name   Last name  Age
0       Tinu    Elejogun   14
1     Javier      Zapata   28
2       Lily   McGarrett   18
3  Olatunkbo    Chijiaku   22
4   Adrienne    Anthoula   22
5     Axelia  Athanasios   22
6  Jon-Kabat        Zinn   22
7    Thabang       Mosoa   15
8   Kgaogelo       Mosoa   11

In [6]:
# display column names
age_df.columns

Index(['First name', 'Last name', 'Age'], dtype='object')

In [9]:
#access one or more columns
age_df['First name']

0         Tinu
1       Javier
2         Lily
3    Olatunkbo
4     Adrienne
5       Axelia
6    Jon-Kabat
7      Thabang
8     Kgaogelo
Name: First name, dtype: object

In [10]:
age_df['Last name']

0      Elejogun
1        Zapata
2     McGarrett
3      Chijiaku
4      Anthoula
5    Athanasios
6          Zinn
7         Mosoa
8         Mosoa
Name: Last name, dtype: object

In [13]:
age_df[['First name', 'Age']]

  First name  Age
0       Tinu   14
1     Javier   28
2       Lily   18
3  Olatunkbo   22
4   Adrienne   22
5     Axelia   22
6  Jon-Kabat   22
7    Thabang   15
8   Kgaogelo   11

In [14]:
# what is NAN value - nb
#Create a column with NaN values
age_df['rank'] = np.nan #returns NAN values
print(age_df)

  First name   Last name  Age  rank
0       Tinu    Elejogun   14   NaN
1     Javier      Zapata   28   NaN
2       Lily   McGarrett   18   NaN
3  Olatunkbo    Chijiaku   22   NaN
4   Adrienne    Anthoula   22   NaN
5     Axelia  Athanasios   22   NaN
6  Jon-Kabat        Zinn   22   NaN
7    Thabang       Mosoa   15   NaN
8   Kgaogelo       Mosoa   11   NaN

In [15]:
#head and tail functions
age_df.head() #prints the first five rows of the table

  First name  Last name  Age  rank
0       Tinu   Elejogun   14   NaN
1     Javier     Zapata   28   NaN
2       Lily  McGarrett   18   NaN
3  Olatunkbo   Chijiaku   22   NaN
4   Adrienne   Anthoula   22   NaN

In [16]:
age_df.tail() #prints the last five rows of the table

  First name   Last name  Age  rank
4   Adrienne    Anthoula   22   NaN
5     Axelia  Athanasios   22   NaN
6  Jon-Kabat        Zinn   22   NaN
7    Thabang       Mosoa   15   NaN
8   Kgaogelo       Mosoa   11   NaN

In [18]:
#assign values to a dataframe using 1. Numpy 2. Series
#1. Numpy
array_1 = np.arange(9)
print(array_1)

[0 1 2 3 4 5 6 7 8]

In [19]:
age_df['rank'] = array_1
print(age_df)

  First name   Last name  Age  rank
0       Tinu    Elejogun   14     0
1     Javier      Zapata   28     1
2       Lily   McGarrett   18     2
3  Olatunkbo    Chijiaku   22     3
4   Adrienne    Anthoula   22     4
5     Axelia  Athanasios   22     5
6  Jon-Kabat        Zinn   22     6
7    Thabang       Mosoa   15     7
8   Kgaogelo       Mosoa   11     8

In [20]:
#2. Series

newrank_series = Series([10,11,12], index=[3,5,6])
age_df['rank'] = newrank_series
print(age_df)

  First name   Last name  Age  rank
0       Tinu    Elejogun   14   NaN
1     Javier      Zapata   28   NaN
2       Lily   McGarrett   18   NaN
3  Olatunkbo    Chijiaku   22  10.0
4   Adrienne    Anthoula   22   NaN
5     Axelia  Athanasios   22  11.0
6  Jon-Kabat        Zinn   22  12.0
7    Thabang       Mosoa   15   NaN
8   Kgaogelo       Mosoa   11   NaN

In [21]:
# delete a column
del(age_df['Last name'])
print(age_df)

  First name  Age  rank
0       Tinu   14   NaN
1     Javier   28   NaN
2       Lily   18   NaN
3  Olatunkbo   22  10.0
4   Adrienne   22   NaN
5     Axelia   22  11.0
6  Jon-Kabat   22  12.0
7    Thabang   15   NaN
8   Kgaogelo   11   NaN

In [27]:
 #convert dictionary to a dataframe
sample_dict = {
    'company' : ['Nestle', 'PG'],
    'profit' : [1000, 500]
}

print(sample_dict)

{'company': ['Nestle', 'PG'], 'profit': [1000, 500]}

In [28]:
sample_df = DataFrame(sample_dict)
print(sample_df)

  company  profit
0  Nestle    1000
1      PG     500